#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/gem-engineering/kubernetes-ops-stage-gem-backend-read/runs/run-d2enmi4RmddN4bud

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.helm_values will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "helm_values"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            replicaCount: ${replica_count}
            
            fullnameOverride: ${fullnameOverride}
            namespace: ${namespace}
            
            
            deployment:
              containers:
              - name: ${fullnameOverride}
                image:
                  repository: ${docker_repository}
                  tag: ${docker_tag}
                  pullPolicy: Always
                args:
                - run
                env:
                  base:
                    - name: READ_ONLY_MODE
                      value: "true"
                    - name: TXINDEX
                      value: "true"
                    - name: GLOG_V
                      value: "0"
                    - name: ADMIN_PUBLIC_KEYS
                      value: "BC1YLjUrkSFEW1XyfZ6JdbdVmDURFG3PxJmZ7LKw4zs6PCFLXKeM2YJ BC1YLfrvJwwAjDcL3Tq2spWbvXCJFadiDdJMyvCaeHgG7snSsYNRKXk BC1YLhKuj76oaT1wwGhfb9GX7rCyc9cxrx54v84fAn9EDuc9zDawgGf BC1YLh6WDX4uCw3pcT7pjEQG7UcLj1KS1SpG3hnLkWg11EiBGjAM6oP BC1YLfyqxLpXsiGt7HvgjaKBjCZjAev82HeM626Nw7zfuYowrY72fGP BC1YLhSkJo5dhiFK38eFdViXm1tsAVi1ZFdNroG1RoB8NJG4JnDLzNK BC1YLijaLPipTCt1rL8fx6Xxt1DGNrasqRsfhKPRihPneqbntpRCzQY"
                    - name: SUPER_ADMIN_PUBLIC_KEYS
                      value: "BC1YLjUrkSFEW1XyfZ6JdbdVmDURFG3PxJmZ7LKw4zs6PCFLXKeM2YJ BC1YLfrvJwwAjDcL3Tq2spWbvXCJFadiDdJMyvCaeHgG7snSsYNRKXk BC1YLhKuj76oaT1wwGhfb9GX7rCyc9cxrx54v84fAn9EDuc9zDawgGf BC1YLh6WDX4uCw3pcT7pjEQG7UcLj1KS1SpG3hnLkWg11EiBGjAM6oP BC1YLfyqxLpXsiGt7HvgjaKBjCZjAev82HeM626Nw7zfuYowrY72fGP BC1YLhSkJo5dhiFK38eFdViXm1tsAVi1ZFdNroG1RoB8NJG4JnDLzNK BC1YLijaLPipTCt1rL8fx6Xxt1DGNrasqRsfhKPRihPneqbntpRCzQY"
                    #- name: POSTGRES_URI
                    #  value: "postgres://${pg_username}:${pg_password}@${pg_hostname}:${pg_port}/${pg_name}"
                    - name: RATE_LIMIT_FEERATE
                      value: "0"
                    - name: MIN_FEERATE
                      value: "1000"
                    - name: STARTER_BITCLOUT_NANOS
                      value: "1000000"
                    - name: MIN_SATOSHIS_FOR_PROFILE
                      value: "50000"
                    - name: DATA_DIR
                      value: "/etc/backend-volume"
                    - name: SQS_URI
                      value: "${sqs_uri}"
                  perEnv: [ ]
                ports:
                - name: http1
                  protocol: TCP
                  containerPort: 17000
                  servicePort: 17000
                - name: http2
                  protocol: TCP
                  containerPort: 17001
                  servicePort: 17001
            
                resources:
                  requests:
                    memory: ${requests_memory}
            
                volumeMounts:
                # name must match the volume name below
                - name: backend-efs-read
                  mountPath: /etc/backend-volume
            
            
            volumes:
            - name: backend-efs-read
              persistentVolumeClaim:
                claimName: backend-efs-read
            
            
            ingress:
              enabled: true
              annotations:
                kubernetes.io/ingress.class: nginx-external
                # kubernetes.io/tls-acme: "true"
              paths:
                - path: /api
                  servicePort: http2
              hosts:
                - api.stage.yourgem.app
              tls: []
              #  - secretName: chart-example-tls
              #    hosts:
              #      - chart-example.local
        EOT
      + vars     = {
          + "docker_repository" = "283278994941.dkr.ecr.us-east-1.amazonaws.com/backend"
          + "docker_tag"        = "v1.2.4"
          + "fullnameOverride"  = "gem-backend-read"
          + "namespace"         = "app-stage"
          + "pg_hostname"       = "foo"
          + "pg_name"           = "foo"
          + "pg_password"       = (sensitive)
          + "pg_port"           = "foo"
          + "pg_username"       = "foo"
          + "replica_count"     = "1"
          + "requests_memory"   = "200Gi"
          + "sqs_uri"           = (known after apply)
        }
    }

  # aws_sqs_queue.transactions-input will be created
  + resource "aws_sqs_queue" "transactions-input" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "transactions-input"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.app.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "standard-application"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gem-backend-read"
      + namespace                  = "app-stage"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm-charts.managedkube.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "1.0.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + transactions-input = (known after apply)

```


</details>

*Pusher: @piratekev, Action: `pull_request`*